Revit 2027 API
ColorFillScheme Class
 Represents a color scheme could be used to colorfy elements in floor plan views and section views.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ColorFillScheme
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ColorFillScheme : Element
Public Class ColorFillScheme
	Inherits Element
public ref class ColorFillScheme : public Element
type ColorFillScheme =
    class
        inherit Element
    end
The ColorFillScheme type exposes the following members.
Properties
Name | Description
AreaSchemeId |  Represents the id of AreaScheme of area plan views that this scheme could be applied to.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CategoryId |  Represents the element category that can be colored by this scheme.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsByRange |  Represents if the parameter values in entries are treated as value range or not.
IsLinkedFilesIncluded |  Represent if the scheme includes entries whose parameter values are based on elements from linked files.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
ParameterDefinition |  Represents the parameter of the elements that this scheme could be used to color.
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
StorageType |  Represents the type of parameter values stored in entries.
Title |  Represents the title displayed in ColorFillLegend.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
Methods
Name | Description
AddEntry |  Adds new entry to the scheme.
AreEntriesConsistentWithScheme |  Checks whether the entries can be set to the scheme or not.
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanDefineByRange |  Checks whether the scheme entries can be explained by range.
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
CanRemoveEntry |  Checks whether entry can be removed from the scheme.
CanUpdateEntry |  Checks whether entry exists in the scheme and not the same as input one.
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Duplicate |  Generates a copy of current scheme.
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetEntries |  Retrieves copies of all entries.
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetFormatOptions |  Returns the FormatOptions of the scheme.
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetSupportedParameterIds |  Retrieves collection of all parameters supported by the scheme.
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsEntryConsistentWithScheme |  Checks whether an entry can be added to the scheme or not.
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsValidParameterDefinitionId |  Checks whether the input parameter id can be applied to the scheme.
IsValidSchemeName |  Checks whether the name is valid for new generated scheme.
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
RemoveEntry |  Removes an entry whose parameter value is the same as the input from the scheme
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetEntries |  Update scheme entries in batch mode.
SetFormatOptions |  Sets the FormatOptions of the scheme.
SortEntries |  Sorts the scheme entries ascending.
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateEntry |  Updates the scheme entry with the same parameter value as the input entry.
Top
Remarks
A color scheme is based on element category and one of the category parameter, it contains a set of ColorFillSchemeEntry which stores parameter value, color, fill pattern and other entry data. The entry paramater values may be a range or a single value, based on the IsByRange property. Then elements with the specified category could be colored with the color and fill pattern of matching entry whose parameter value or value range matches the element parameter value.
You can retrieve the entries with GetEntries(), or modify entries with AddEntry(ColorFillSchemeEntry), RemoveEntry(ColorFillSchemeEntry), UpdateEntry(ColorFillSchemeEntry) and SetEntries().
Unlike most of the other elements, the color scheme works in an "asynchronous" way in UI:
If document elements change, the color scheme will not be updated immediately.
If color schemes changes, the document elements will not be updated immediately too.
API works slightly different with UI:
GetEntries() will return the entries corresponding to the latest document elements status immediately.
The entries modification operation will retrieve the latest entries with GetEntries() at first, and then modify those entries by request, but document elements will still not be updated immediately.
To modify multiple entries, it's better to use SetEntries() but not modify them one by one with other methods for better performance.
Notes:
To apply a color scheme whose CategoryId property is OST_Areas to an area plan view, the AreaSchemeId property must be the same as the view if it is not used as a template.
To generate a new color scheme, you have to use Duplicate(String) method to duplicate form an existing one.
There should not exist two entries values that are the same in a color scheme. if the StorageType property is Double, then the value accuracy should be based on FormatOptions property.
See Also
Reference
Autodesk.Revit.DB Namespace